/**
 * Created by Administrator on 2017/4/9.
 */
var review = {

    "8-9.15":"可视化数据展示怎么做有利于数据的传输和业务层的逻辑结合逻辑思维能力1.配置2.计算3.展示,后期补充：使用angular,mvc框架实现，dom层，ajax,事件控制层的分离",
    "9.15-10.2":"数据处理,数据的缓存与读取,文件的上传与下载canvas画布",
    "10.3-10.16":["jquery","jqGrid源码分析","dom操作"],
    "10.7-11.13":["前端调试方法学习2",
                  " workspace",
                  "jqGrid",
                  " 写代码！写代码！写代码！"],
    "10.17-10.30":[
                "jqGrid API使用",
                "数据上传：ajax form上传方式",
                "前端调试方法学习"],
    "10.31-11.6":["bug回归：",
                "jqGrid高宽，溢出",
                "特殊情况未处理",
                "website样式优化"],
    "11.14-11.20":[
                "写代码！写代码！写代码！",
                "多写项目。",
                "canvas 事件绑定",
                "form无刷新表单提交"],
    "11.21-12.04":[
                "写代码！写代码！写代码！多些项目。",
                "天下武功，唯快不破，学习 思维很重要",
                "后期补充：代码写的多，思维自然会提上来"],
    "12.5-12.11":[
                "浏览器调试方法进断点，出断点",
                "通过dom监听可以快速定位代码"
                 ],
    "12.12-12.25":[
                "ionic",
                "angular.js",
                "ipwan 表格代码分析",
                "登录弹出框代码分析"],
    "1.3 - 1.8":[
                "ipwan表格代码优化",
                "删除 framework.js 精简代码"],
    "2.6-4.2":[
                "写表格插件",
                "学习java","数据库"
    ],
    "4.2 - 4.9":[
                "node.js",
                "百度网盘"]
}
